CaptainJi/esp32_flight_radar/components/sd_storage/sd_storage.cpp
#include "sd_storage.h"
#include "esphome/components/storage/fatfs_select.h"

#ifdef USE_SD_STORAGE_SDMMC

#include "esphome/core/log.h"
#include <sys/stat.h>
#include <errno.h>
#include <cstdio>
#include "esp_vfs.h"
#include "esp_vfs_fat.h"
#include "ff.h"
#include "diskio_sdmmc.h"
#ifdef USE_STORAGE_FILE_SYSTEM_SELECT
// FF_DRV_NOT_USED, ff_diskio_get_drive(), ff_diskio_register() -- the generic diskio layer
// the manual mount mirror drives; diskio_sdmmc.h above only covers the sdmmc binding.
#include "diskio_impl.h"
#endif
#include "sdmmc_cmd.h"
#include "driver/sdmmc_host.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "esp_idf_version.h"
#include "esphome/components/storage/storage.h"

#if defined(USE_ESP32_VARIANT_ESP32P4)
// === 本地覆寫:相對於 p1ngb4ck/esphome@d15c20d 的唯一改動 ===
// 上游從不設定 host.pwr_ctrl_handle。在 ESP32-P4 上,SD 卡的 IO 電軌是由晶片內部
// LDO 供電的,不打開就沒電,卡永遠不會回應(掛載重試三次後失敗)。
// Espressif 官方 BSP 的做法見 esp-bsp/bsp/esp32_p4_function_ev_board/
// esp32_p4_function_ev_board.c:199 —— 建立 on-chip LDO 電源控制再掛到 host 上。
// 通道編號在 P4 Function EV Board 與沿用其接線的板子(含 Waveshare 7B)上是 4;
// 板子不同就用 build_flags 覆寫 -DSD_STORAGE_P4_LDO_CHAN=<n>。
#include "sd_pwr_ctrl_by_on_chip_ldo.h"
#ifndef SD_STORAGE_P4_LDO_CHAN
#define SD_STORAGE_P4_LDO_CHAN 4
#endif
#endif

namespace esphome::sd_storage {

static const char *const TAG = "sd_storage";

#if defined(USE_ESP32_VARIANT_ESP32P4)
static sd_pwr_ctrl_handle_t s_pwr_ctrl = nullptr;   // 只建立一次,unmount/remount 共用
#endif

void SdMmc::setup() {
  ESP_LOGD(TAG, "Initializing SD/MMC card");
  ESP_LOGD(TAG, "  CLK pin: %d, CMD pin: %d, DATA0 pin: %d", this->clk_pin_, this->cmd_pin_, this->data0_pin_);
  if (!this->mode_1bit_) {
    ESP_LOGD(TAG, "  DATA1 pin: %d, DATA2 pin: %d, DATA3 pin: %d", this->data1_pin_, this->data2_pin_,
             this->data3_pin_);
  } else {
    ESP_LOGD(TAG, "  Operating in 1-bit mode");
  }
  ESP_LOGD(TAG, "  Mount path: %s, Slot: %d", this->mount_path_, this->slot_);

  if (this->cs_pin_ != nullptr) {
    this->cs_pin_->setup();
  }

  // Register before attempting to mount, not only on success -- get_info() reports is_mounted
  // correctly either way, and this lets the device (and its mount/unmount/list_files actions)
  // show up in the registry even if the initial mount fails, instead of only existing once a
  // card happens to be present. No mark_failed() here: a failed mount is not a broken
  // component, and this lets sd_storage.mount retry later without a reboot.
  if (storage::global_storage_registry != nullptr)
    if (storage::global_storage_registry->register_storage(this) != storage::StorageError::OK) {
      // Registry full = codegen/runtime device-count mismatch: the device would be invisible
      // to resolve_path()/consumers. Fatal -- do not run with a silently missing device.
      ESP_LOGE(TAG, "Storage registration failed");
      this->mark_failed();
    }

  if (this->cd_pin_ != nullptr) {
    this->cd_pin_->setup();
    // With a CD pin configured, only mount if a card is actually seen at boot -- otherwise wait
    // for loop()'s polling to pick up an insertion later, rather than logging a spurious "Failed
    // to mount" for a socket that's simply empty right now. No mark_failed() either way, same
    // rationale as above.
    if (this->card_present_()) {
      if (this->mount() != storage::StorageError::OK) {
        ESP_LOGE(TAG, "Failed to mount SD/MMC card");
      }
    } else {
      ESP_LOGD(TAG, "Waiting for card (CD)");
    }
  } else if (this->mount() != storage::StorageError::OK) {
    ESP_LOGE(TAG, "Failed to mount SD/MMC card");
  }
}

void SdMmc::loop() { this->loop_cd_(); }

void SdMmc::dump_config() {
  ESP_LOGCONFIG(TAG, "SD/MMC Card:");
  ESP_LOGCONFIG(TAG, "  Mounted: %s", this->is_mounted_ ? "YES" : "NO");
  ESP_LOGCONFIG(TAG, "  Mount path: %s", this->mount_path_);
  LOG_PIN("  CD Pin: ", this->cd_pin_);
  ESP_LOGCONFIG(TAG, "  Data rate: %" PRIu32 " kHz", this->data_rate_khz_);
  if (this->is_mounted_) {
    ESP_LOGCONFIG(TAG, "  Card Type: %s", SdStorageBase::card_type_to_string(this->card_type_));
    ESP_LOGCONFIG(TAG, "  Total bytes: %" PRIu64, this->total_bytes_);
    ESP_LOGCONFIG(TAG, "  Used bytes: %" PRIu64, this->used_bytes_);
  }
}

#ifdef USE_STORAGE_FILE_SYSTEM_SELECT
esp_err_t SdMmc::mount_manual_(sdmmc_host_t &host, sdmmc_slot_config_t &slot_config) {
  // Step for step what esp_vfs_fat_sdmmc_mount does (all public IDF API), with the probe
  // window inserted between diskio registration and f_mount.
  auto *card = new sdmmc_card_t{};  // NOLINT(cppcoreguidelines-owning-memory) - freed in unmount_manual_
  esp_err_t err = host.init != nullptr ? host.init() : ESP_OK;
  if (err != ESP_OK && err != ESP_ERR_INVALID_STATE) {  // INVALID_STATE: host already up
    delete card;                                        // NOLINT(cppcoreguidelines-owning-memory)
    return err;
  }
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(6, 0, 0)
  // Pre-6 builds initialised the slot before mount() already (see setup above).
  err = sdmmc_host_init_slot(host.slot, &slot_config);
  if (err != ESP_OK) {
    delete card;  // NOLINT(cppcoreguidelines-owning-memory)
    return err;
  }
#else
  (void) slot_config;
#endif
  err = ESP_FAIL;
  for (int attempt = 1; attempt <= 3; attempt++) {
    ESP_LOGD(TAG, "Initialising SD card slot %d (attempt %d/3)", this->slot_, attempt);
    err = sdmmc_card_init(&host, card);
    if (err == ESP_OK)
      break;
    ESP_LOGW(TAG, "Card init attempt %d failed: %s", attempt, esp_err_to_name(err));
    vTaskDelay(pdMS_TO_TICKS(100));
  }
  if (err != ESP_OK) {
    delete card;  // NOLINT(cppcoreguidelines-owning-memory)
    return err;
  }

  BYTE pdrv = FF_DRV_NOT_USED;
  if (ff_diskio_get_drive(&pdrv) != ESP_OK || pdrv == FF_DRV_NOT_USED) {
    delete card;  // NOLINT(cppcoreguidelines-owning-memory)
    return ESP_ERR_NO_MEM;
  }
  ff_diskio_register_sdmmc(pdrv, card);
  char drv[3] = {static_cast<char>('0' + pdrv), ':', '\0'};

  // The point of this path: the requested filesystem is enforced BEFORE the mount.
  if (!storage::ensure_requested_filesystem(TAG, pdrv, drv, this->requested_file_system_)) {
    ff_diskio_register(pdrv, nullptr);
    delete card;  // NOLINT(cppcoreguidelines-owning-memory)
    return ESP_FAIL;
  }

  FATFS *fs = nullptr;
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 3, 0)
  esp_vfs_fat_conf_t vfs_conf = {
      .base_path = this->mount_path_,
      .fat_drive = drv,
      .max_files = 16,
  };
  err = esp_vfs_fat_register_cfg(&vfs_conf, &fs);
#else
  err = esp_vfs_fat_register(this->mount_path_, drv, 16, &fs);
#endif
  if (err != ESP_OK) {
    ff_diskio_register(pdrv, nullptr);
    delete card;  // NOLINT(cppcoreguidelines-owning-memory)
    return err;
  }
  FRESULT res = f_mount(fs, drv, 1);
  if (res != FR_OK) {
    ESP_LOGE(TAG, "f_mount failed: %d", res);
    esp_vfs_fat_unregister_path(this->mount_path_);
    ff_diskio_register(pdrv, nullptr);
    delete card;  // NOLINT(cppcoreguidelines-owning-memory)
    return ESP_FAIL;
  }
  this->card_ = card;
  return ESP_OK;
}

void SdMmc::unmount_manual_() {
  BYTE pdrv = ff_diskio_get_pdrv_card(this->card_);
  if (pdrv != FF_DRV_NOT_USED) {
    char drv[3] = {static_cast<char>('0' + pdrv), ':', '\0'};
    f_mount(nullptr, drv, 0);
    ff_diskio_register(pdrv, nullptr);
  }
  esp_vfs_fat_unregister_path(this->mount_path_);
  delete this->card_;  // NOLINT(cppcoreguidelines-owning-memory)
}
#endif  // USE_STORAGE_FILE_SYSTEM_SELECT

storage::StorageError SdMmc::mount() {
  sdmmc_host_t host = SDMMC_HOST_DEFAULT();
  host.max_freq_khz = static_cast<int>(this->data_rate_khz_);
  host.flags = this->mode_1bit_ ? SDMMC_HOST_FLAG_1BIT : SDMMC_HOST_FLAG_4BIT;
  host.slot = this->slot_;

#if defined(USE_ESP32_VARIANT_ESP32P4)
  // 本地覆寫(見檔首):P4 的 SD IO 電軌要先把晶片內部 LDO 打開,否則卡不會回應。
  // 必須在下面的 sdmmc_host_init_slot() 之前;host 是傳參考給 mount_manual_(),
  // 所以兩條掛載路徑都吃得到。
  if (s_pwr_ctrl == nullptr) {
    sd_pwr_ctrl_ldo_config_t ldo_config = {};
    ldo_config.ldo_chan_id = SD_STORAGE_P4_LDO_CHAN;
    esp_err_t ldo_ret = sd_pwr_ctrl_new_on_chip_ldo(&ldo_config, &s_pwr_ctrl);
    if (ldo_ret != ESP_OK) {
      // 不直接失敗:若某塊板子的 SD 電軌是外部固定供電,沒有 LDO 也可能掛得起來。
      ESP_LOGW(TAG, "on-chip LDO ch%d unavailable: %s (SD may not power up)", SD_STORAGE_P4_LDO_CHAN,
               esp_err_to_name(ldo_ret));
      s_pwr_ctrl = nullptr;
    } else {
      ESP_LOGD(TAG, "  SD IO powered by on-chip LDO channel %d", SD_STORAGE_P4_LDO_CHAN);
    }
  }
  host.pwr_ctrl_handle = s_pwr_ctrl;
#endif

  sdmmc_slot_config_t slot_config = SDMMC_SLOT_CONFIG_DEFAULT();
  slot_config.width = this->mode_1bit_ ? 1 : 4;

#ifdef SOC_SDMMC_USE_GPIO_MATRIX
  slot_config.clk = static_cast<gpio_num_t>(this->clk_pin_);
  slot_config.cmd = static_cast<gpio_num_t>(this->cmd_pin_);
  slot_config.d0 = static_cast<gpio_num_t>(this->data0_pin_);
  if (!this->mode_1bit_) {
    slot_config.d1 = static_cast<gpio_num_t>(this->data1_pin_);
    slot_config.d2 = static_cast<gpio_num_t>(this->data2_pin_);
    slot_config.d3 = static_cast<gpio_num_t>(this->data3_pin_);
  }
#endif
  slot_config.flags |= SDMMC_SLOT_FLAG_INTERNAL_PULLUP;

#if ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(6, 0, 0)
  {
    esp_err_t pre_ret = sdmmc_host_init_slot(host.slot, &slot_config);
    if (pre_ret != ESP_OK) {
      ESP_LOGE(TAG, "Failed to init SDMMC slot %d: %s", this->slot_, esp_err_to_name(pre_ret));
      return storage::StorageError::NOT_READY;
    }
  }
#endif

  const esp_vfs_fat_mount_config_t mount_config = {
      .format_if_mount_failed = false,
      .max_files = 16,
      .allocation_unit_size = 256 * 1024,
  };

  esp_err_t ret = ESP_FAIL;
#ifdef USE_STORAGE_FILE_SYSTEM_SELECT
  (void) mount_config;
  ret = this->mount_manual_(host, slot_config);
#else
  for (int attempt = 1; attempt <= 3; attempt++) {
    ESP_LOGD(TAG, "Mounting SD card slot %d to '%s' (attempt %d/3)", this->slot_, this->mount_path_, attempt);
    ret = esp_vfs_fat_sdmmc_mount(this->mount_path_, &host, &slot_config, &mount_config, &this->card_);
    if (ret == ESP_OK)
      break;
    ESP_LOGW(TAG, "Mount attempt %d failed: %s", attempt, esp_err_to_name(ret));
    vTaskDelay(pdMS_TO_TICKS(100));
  }
#endif

  if (ret != ESP_OK) {
    ESP_LOGE(TAG, "Failed to mount SD card: %s", esp_err_to_name(ret));
    return storage::StorageError::NOT_READY;
  }

  if (this->card_->is_mmc) {
    this->card_type_ = CardType::MMC;
  } else if (this->card_->is_sdio) {
    this->card_type_ = CardType::SDIO;
  } else {
    this->card_type_ = (this->card_->ocr & (1 << 30)) ? CardType::SDHC : CardType::SDSC;
  }
  this->block_size_ = this->card_->csd.sector_size;
  this->is_mounted_ = true;
#ifdef USE_STORAGE_CHANGE_FEED
  // Mount state is part of the roots listing: whoever flipped it (CD pin, hotplug, HTTP,
  // automation), the browser's change poll must see it -- including recovery after an error.
  if (storage::global_storage_registry != nullptr)
    storage::global_storage_registry->note_dir_changed("");
#endif

  this->set_fatfs_drive_(ff_diskio_get_pdrv_card(this->card_));
  this->update_card_info();

  ESP_LOGI(TAG, "SD/MMC card mounted at %s", this->mount_path_);

  if (storage::global_storage_registry != nullptr)
    if (storage::global_storage_registry->register_storage(this) != storage::StorageError::OK) {
      // Registry full = codegen/runtime device-count mismatch: the device would be invisible
      // to resolve_path()/consumers. Fatal -- do not run with a silently missing device.
      ESP_LOGE(TAG, "Storage registration failed");
      this->mark_failed();
    }

  this->on_mounted_.call(this->mount_path_);

  return storage::StorageError::OK;
}

storage::StorageError SdMmc::unmount() {
  if (!this->is_mounted_ || this->card_ == nullptr)
    return storage::StorageError::OK;

  // Quiesce before the VFS unmount below -- same drain guarantee as unregister_storage()
  // (no in-flight storage_worker data-plane call against this device remains, handles the
  // worker opened are closed), but the device stays registered: registered-but-unmounted
  // is its normal state, so there is nothing to re-register afterwards.
  if (storage::global_storage_registry != nullptr)
    storage::global_storage_registry->quiesce_storage(this);

  ESP_LOGD(TAG, "Syncing filesystem before unmount");
  // Closes any handles still open from user/lambda code, while the VFS is still mounted to
  // receive the flush/close calls.
  this->flush_open_handles_();
  ESP_LOGD(TAG, "All data flushed");

#ifdef USE_STORAGE_FILE_SYSTEM_SELECT
  this->unmount_manual_();
#else
  esp_vfs_fat_sdcard_unmount(this->mount_path_, this->card_);
#endif
  this->card_ = nullptr;
  this->is_mounted_ = false;
#ifdef USE_STORAGE_CHANGE_FEED
  // Mount state is part of the roots listing: whoever flipped it (CD pin, hotplug, HTTP,
  // automation), the browser's change poll must see it -- including recovery after an error.
  if (storage::global_storage_registry != nullptr)
    storage::global_storage_registry->note_dir_changed("");
#endif

  ESP_LOGI(TAG, "SD/MMC card unmounted safely");

  return storage::StorageError::OK;
}

bool SdMmc::update_card_info() {
  if (!this->is_mounted_ || this->card_ == nullptr)
    return false;

  this->total_bytes_ = (uint64_t) this->card_->csd.capacity * this->card_->csd.sector_size;

  FATFS *fs;
  DWORD fre_clust;
  char path_buf[8];
  snprintf(path_buf, sizeof(path_buf), "%s/", this->mount_path_);
  if (f_getfree(path_buf, &fre_clust, &fs) == FR_OK) {
    uint64_t total = (uint64_t) ((fs->n_fatent - 2) * fs->csize) * fs->ssize;
    uint64_t free_b = (uint64_t) (fre_clust * fs->csize) * fs->ssize;
    this->used_bytes_ = total - free_b;
  }
  return true;
}

uint64_t SdMmc::get_free_bytes_impl() const {
  if (!this->is_mounted_)
    return 0;

  FATFS *fs;
  DWORD fre_clust;
  char path_buf[8];
  snprintf(path_buf, sizeof(path_buf), "%s/", this->mount_path_);
  if (f_getfree(path_buf, &fre_clust, &fs) != FR_OK)
    return 0;
  return (uint64_t) (fre_clust * fs->csize) * fs->ssize;
}

}  // namespace esphome::sd_storage

#endif  // USE_SD_STORAGE_SDMMC
